---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarInternalMultiplanarEndConnector
source: html/00c577f1-66ad-2d08-b46a-9bc2b5b344d5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarInternalMultiplanarEndConnector Property

"INTERNAL: Multiplanar End Connector"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarInternalMultiplanarEndConnector { get; }
```